saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F7xx_DFP.2.11.0.pdsc
        <!-- *************************  Device 'STM32F723ZE'  ***************************** -->
        <device Dname="STM32F723ZE">
          <memory id="IROM1"                                 start="0x08000000" size="0x80000" default="1" startup="1" />
          <memory id="IROM2"                                 start="0x00200000" size="0x80000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x2TCM_512.FLM" start="0x00200000" size="0x80000" default="1" />

          <variant Dvariant="STM32F723ZETx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F723ZEIx"> <feature type="BGA" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F723IE'  ***************************** -->
        <device Dname="STM32F723IE">
          <memory id="IROM1"                                 start="0x08000000" size="0x80000" default="1" startup="1" />
          <memory id="IROM2"                                 start="0x00200000" size="0x80000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x80000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x2TCM_512.FLM" start="0x00200000" size="0x80000" default="1" />

          <variant Dvariant="STM32F723IETx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F723IEKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F723ZC'  ***************************** -->
        <device Dname="STM32F723ZC">
          <memory id="IROM1"                                 start="0x08000000" size="0x40000" default="1" startup="1" />
          <memory id="IROM2"                                 start="0x00200000" size="0x40000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x2TCM_512.FLM" start="0x00200000" size="0x40000" default="1" />

          <variant Dvariant="STM32F723ZCTx"> <feature type="QFP" n="144"/> </variant>
          <variant Dvariant="STM32F723ZCIx"> <feature type="BGA" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F723IC'  ***************************** -->
        <device Dname="STM32F723IC">
          <memory id="IROM1"                                 start="0x08000000" size="0x40000" default="1" startup="1" />
          <memory id="IROM2"                                 start="0x00200000" size="0x40000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x2_512.FLM"    start="0x08000000" size="0x40000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x2TCM_512.FLM" start="0x00200000" size="0x40000" default="1" />

          <variant Dvariant="STM32F723ICTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F723ICKx"> <feature type="BGA" n="176"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F730' **************************** -->
      <subFamily DsubFamily="STM32F730">
        <processor Dfpu="SP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F730x.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F730xx"/>

         <debugvars configfile="CMSIS/Debug/STM32F72x_73x.dbgconf" version="2.0.0">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1" start="0x20010000" size="0x30000" init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x10000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32F72x_73x_OPT.FLM" start="0x1FFF0000" size="0x000C" default="0"/>
        <algorithm name="CMSIS/Flash/STM32F7x2_OTP.FLM"     start="0x1FF07800" size="0x0210" default="0"/>

        <book name="Documentation/DM00305990.pdf"  title="STM32F72xxx/3xxx Reference Manual"/>
        <book name="Documentation/stm32f730i8.pdf" title="STM32F730x8 Data Sheet"/>

        <!-- *************************  Device 'STM32F730R8'  ***************************** -->
         <device Dname="STM32F730R8">
          <memory id="IROM1"                                start="0x08000000" size="0x10000" default="1" startup="1" />
          <memory id="IROM2"                                start="0x00200000" size="0x10000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_AXI.FLM" start="0x08000000" size="0x10000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_TCM.FLM" start="0x00200000" size="0x10000" default="0" />

          <variant Dvariant="STM32F730R8Tx"> <feature type="QFP" n="64"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F730V8'  ***************************** -->
        <device Dname="STM32F730V8">
          <memory id="IROM1"                                start="0x08000000" size="0x10000" default="1" startup="1" />
          <memory id="IROM2"                                start="0x00200000" size="0x10000" default="0" startup="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_AXI.FLM" start="0x08000000" size="0x10000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_64_TCM.FLM" start="0x00200000" size="0x10000" default="0" />

          <variant Dvariant="STM32F730V8Tx"> <feature type="QFP" n="100"/> </variant>
        </device>
