saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F7xx_DFP.2.11.0.pdsc
    <condition id="STM32F7x8_7x9">
      <description>STMicroelectronics STM32F7x8/7x9 Series devices</description>
      <accept  condition="STM32F7x8"/>
      <accept  condition="STM32F7x9"/>
    </condition>
    <condition id="STM32F756_777_779_750">
      <description>STMicroelectronics STM32F756/777/779/750 Series devices</description>
      <accept  condition="STM32F756"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F779"/>
      <accept  condition="STM32F750"/>
    </condition>
    <condition id="STM32F7x7_7x8_7x9">
      <description>STMicroelectronics STM32F767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>

    <condition id="STM32F745_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F746_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F756_ARMCC">
      <description>filter for STM32F756 devices and the ARM compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F765_ARMCC">
      <description>filter for STM32F765 devices and the ARM compiler</description>
      <require condition="STM32F765"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F767_ARMCC">
      <description>filter for STM32F767 devices and the ARM compiler</description>
      <require condition="STM32F767"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F768_ARMCC">
      <description>filter for STM32F768 devices and the ARM compiler</description>
      <require condition="STM32F768"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F769_ARMCC">
      <description>filter for STM32F769 devices and the ARM compiler</description>
      <require condition="STM32F769"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F777_ARMCC">
      <description>filter for STM32F777 devices and the ARM compiler</description>
      <require condition="STM32F777"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F778_ARMCC">
      <description>filter for STM32F778 devices and the ARM compiler</description>
      <require condition="STM32F778"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F779_ARMCC">
      <description>filter for STM32F779 devices and the ARM compiler</description>
      <require condition="STM32F779"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F722_ARMCC">
      <description>filter for STM32F722 devices and the ARM compiler</description>
      <require condition="STM32F722"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F723_ARMCC">
      <description>filter for STM32F723 devices and the ARM compiler</description>
      <require condition="STM32F723"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F732_ARMCC">
      <description>filter for STM32F732 devices and the ARM compiler</description>
      <require condition="STM32F732"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F733_ARMCC">
      <description>filter for STM32F733 devices and the ARM compiler</description>
      <require condition="STM32F733"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F730_ARMCC">
      <description>filter for STM32F730 devices and the ARM compiler</description>
      <require condition="STM32F730"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F750_ARMCC">
      <description>filter for STM32F750 devices and the ARM compiler</description>
      <require condition="STM32F750"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F72x_73x_ARMCC">
      <description>filter for STM32F72x/3x devices and the ARM compiler</description>
      <accept condition="STM32F722"/>
      <accept condition="STM32F723"/>
      <accept condition="STM32F732"/>
      <accept condition="STM32F733"/>
      <accept condition="STM32F730"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F74x_75x_ARMCC">
      <description>filter for STM32F74x/5x devices and the ARM compiler</description>
      <accept condition="STM32F745"/>
      <accept condition="STM32F746"/>
      <accept condition="STM32F756"/>
      <accept condition="STM32F750"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F76x_77x_ARMCC">
      <description>filter for STM32F76x/7x devices and the ARM compiler</description>
      <accept condition="STM32F765"/>
      <accept condition="STM32F767"/>
      <accept condition="STM32F768"/>
      <accept condition="STM32F769"/>
      <accept condition="STM32F777"/>
      <accept condition="STM32F778"/>
      <accept condition="STM32F779"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F745_GCC">
      <description>filter for STM32F745 devices and the GCC compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F746_GCC">
      <description>filter for STM32F746 devices and the GCC compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F756_GCC">
      <description>filter for STM32F756 devices and the GCC compiler</description>
      <require condition="STM32F756"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F765_GCC">
      <description>filter for STM32F765 devices and the GCC compiler</description>
      <require condition="STM32F765"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F767_GCC">
      <description>filter for STM32F767 devices and the GCC compiler</description>
      <require condition="STM32F767"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F768_GCC">
      <description>filter for STM32F768 devices and the GCC compiler</description>
      <require condition="STM32F768"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F769_GCC">
      <description>filter for STM32F769 devices and the GCC compiler</description>
      <require condition="STM32F769"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32F777_GCC">
      <description>filter for STM32F777 devices and the GCC compiler</description>
      <require condition="STM32F777"/>
      <require Tcompiler="GCC"/>
    </condition>
