saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F7xx_DFP.2.11.0.pdsc
    <condition id="STM32F7 HAL DMA">
      <description>STMicroelectronics STM32F7 Device and HAL with DMA</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>

    <condition id="STM32F7 HAL GPIO ADC">
      <description>STMicroelectronics STM32F7 Device and HAL with GPIO nad ADC</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>

    <condition id="STM32F7 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>STMicroelectronics STM32F7 Device and HAL with LTDC and DMA2D and Graphics with LCD (RGB IF)</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="RGB IF"/>
    </condition>

    <condition id="STM32F7 HAL LTDC DMA2D DSI OTM8009A Graphics LCD_RGB">
      <description>STMicroelectronics STM32F7 Device and HAL with LTDC and DMA2D and Graphics with LCD (RGB IF)</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DSI"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="RGB IF"/>
    </condition>

    <condition id="STM32F7 CMSIS_Driver CAN">
      <description>Requirement for CMSIS CAN Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32F7 CMSIS_Driver SPI">
      <description>Requirement for CMSIS SPI Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F7 CMSIS_Driver USART">
      <description>Requirement for CMSIS USART Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F7 CMSIS_Driver I2C">
      <description>Requirement for CMSIS I2C Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F7 CMSIS_Driver MCI">
      <description>Requirement for CMSIS MCI Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F7 CMSIS_Driver SAI">
      <description>Requirement for CMSIS SAI Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F7 CMSIS_Driver ETH_MAC">
      <description>Requirement for CMSIS EMAC Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32F7 CMSIS_Driver USB">
      <description>Requirement for CMSIS USB Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>

    <condition id="STM32F7 CMSIS SAI and I2C Driver">
      <description>STM32F7 CMSIS SAI and I2C</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0.0"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0"/>
    </condition>

    <condition id="STM32F769I-Discovery LCD_RGB">
      <description>STMicroelectronics STM32F769I-Discovery LCD (RGB IF)</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Graphics Display" Cgroup="STM32F769I-Discovery" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32F769I-Discovery GLCD">
      <description>STMicroelectronics STM32F769I-Discovery GLCD</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="LCD"/>
    </condition>
    <condition id="STM32F769I-Discovery TS">
      <description>STMicroelectronics STM32F769I-Discovery TS</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Touch Screen"/>
    </condition>

