saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F7xx_DFP.2.11.0.pdsc
      <component Cgroup="Drivers" Csub="QSPI" condition="STM32F769I-EVAL BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD" condition="STM32F769I-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM" condition="STM32F769I-EVAL BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sdram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM" condition="STM32F769I-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen" condition="STM32F769I-EVAL BSP TS">
        <description>Touch Screen for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32F769I_EVAL/stm32f769i_eval_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft6x06/ft6x06.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/LED_769I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/Buttons_769I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F7 HAL GPIO ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/ADC_769I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F769I-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/Joystick_769I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" condition="STM32F769I-EVAL TS">
        <description>Touchscreen Interface for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/Touch_769I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F769I-EVAL GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32F769I_EVAL/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/GLCD_769I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="RGB IF" condition="STM32F769I-EVAL LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32F769I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/LCD_X.c"/>
          <file category="source" name="Drivers/BSP/Components/otm8009a/otm8009a.c"/>
          <file category="header" name="Drivers/BSP/Components/otm8009a/otm8009a.h"/>
        </files>
      </component>
<!--
      <component Cgroup="Audio" Capiversion="1.1" condition="STM32F7 CMSIS SAI and I2C Driver">
        <description>Audio interface for WM8994</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F769I_EVAL/Common/Audio_769I_EVAL.c"/>
        </files>
      </component>
-->
    </bundle>

    <!-- STM32F746G-Discovery Board -->
    <bundle Cbundle="STM32F746G-Discovery" Cclass="Board Support" Cversion="1.1.1">
      <description>STMicroelectronics STM32F746G-Discovery Kit</description>
      <doc>MDK/Boards/ST/STM32F746G_Discovery/Documentation/DM00190424.pdf</doc>
<!--
      <component Cgroup="Documentation" condition="STM32F7">
      <description>STM32F746G-Discovery BSP User Manual</description>
      <files>
        <file category="doc" name="Drivers/BSP/STM32746G-Discovery/STM32746G-Discovery_BSP_User_Manual.chm" />
      </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="Basic I/O" condition="STM32F746G-Discovery BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio" condition="STM32F746G-Discovery BSP Audio">
        <description>Audio for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Camera" condition="STM32F746G-Discovery BSP Camera">
        <description>Camera for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_camera.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_camera.c"/>
          <file category="source" name="Drivers/BSP/Components/ov9655/ov9655.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM" condition="STM32F746G-Discovery BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD" condition="STM32F746G-Discovery BSP LCD">
        <description>LCD for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_lcd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI" condition="STM32F746G-Discovery BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD" condition="STM32F746G-Discovery BSP SD">
        <description>uSD for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM" condition="STM32F746G-Discovery BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_sdram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen" condition="STM32F746G-Discovery BSP TS">
        <description>Touch Screen for STMicroelectronics STM32F746G-Discovery Kit</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft5336/ft5336.c"/>
        </files>
      </component>
