saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F7xx_DFP.2.11.0.pdsc
    <!-- STM32F769I-EVAL -->
    <board vendor="STMicroelectronics" name="STM32F769I-EVAL" revision="Rev.A" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32F769I-EVAL Evaluation Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F769I_EVAL/Documentation/stm32f769i-eval_small.jpg"
             large="MDK/Boards/ST/STM32F769I_EVAL/Documentation/stm32f769i-eval_large.jpg"/>
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/stm32f769i-eval.html" title="STM32F769I_EVAL Evaluation Board Web Page"/>
      <!--book category="manual"  name="Drivers/BSP/STM32F769I_EVAL/STM32F769I_EVAL_BSP_User_Manual.chm" title="BSP User Manual"/-->
      <book category="manual"    name="MDK/Boards/ST/STM32F769I_EVAL/Documentation/DM00276567.pdf" title="User Manual"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F769I_EVAL/Documentation/stm32f7x9i-eval_sch.zip" title="Schematics"/>
      <book category="other"     name="MDK/Boards/ST/STM32F769I_EVAL/Documentation/stm32f7x9i-eval_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F769I_EVAL/Documentation/stm32f7x9i-eval_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F769NIHx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F769"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F779"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="RAM"       n="1"              name="8M x 32-bit SDRAM"/>
      <feature type="RAM"       n="1"              name="1M x 16-bit SRAM"/>
      <feature type="ROM"       n="1"              name="8M x 16-bit Nor Flash"/>
      <feature type="ROM"       n="1"              name="512-Mbit Quad-SPI NOR Flash"/>
      <feature type="USB"       n="1"              name="High-Speed USB with micro-AB Connector"/>
      <feature type="USB"       n="2"              name="Full-Speed USB with micro-AB Connector"/>
      <feature type="Joystick"  n="1"              name="5-position Joystick"/>
      <feature type="Camera"    n="1"/>
      <feature type="Button"    n="2"              name="Push-Buttons for Reset, Wakeup/Tamper or Key"/>
      <feature type="LED"       n="4"              name="4 color user LEDs"/>
      <feature type="GLCD"      n="1"  m="800.480" name="4-inch 800x480 TFT color LCD with capacitive touch panel"/>
      <feature type="Poti"      n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"    n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"   n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="MIC"       n="2"              name="ST MEMS microphones"/>
      <feature type="Speaker"   n="2"/>
      <feature type="Other"     n="1"              name="Digital Stereo Microphone"/>
      <feature type="CAN"       n="1"/>
      <feature type="RS232"     n="1"/>
      <feature type="I2C"       n="4"/>
      <feature type="ETH"       n="1"              name="10/100 Ethernet Port"/>
      <feature type="XTAL"      n="25000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="MemCard"   n="1"              name="SDIO interface microSD card"/>
      <feature type="DIO"       n="34"             name="Motor Control Connector"/>
      <feature type="DIO"       n="60"             name="Daughterboard Extension header 1"/>
      <feature type="DIO"       n="60"             name="Daughterboard Extension header 2"/>
      <feature type="ConnOther" n="1"              name="Motor control connector"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>

    <!-- STM32F746G-Discovery -->
    <board vendor="STMicroelectronics" name="STM32F746G-Discovery" revision="Rev.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32F746G-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_small.jpg"
             large="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_large.jpg"/>
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/32f746gdiscovery.html" title="STM32F746G_Discovery Web Page"/>
      <book category="manual"    name="Drivers/BSP/STM32746G-Discovery/STM32746G-Discovery_BSP_User_Manual.chm" title="BSP User Manual"/>
      <!--book category="setup"     name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/DM00092826.pdf" title="Getting Started"/-->
      <book category="setup"     name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/32F746GDISCOVERY_QSG.pdf"    title="STM32F746G-Discovery Quick Start Guide"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_sch.zip"    title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/DM00190424.pdf"              title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F746G_Discovery/Documentation/stm32f746g-disco_bom.zip"    title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F746NGHx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F746"/>
      <feature type="ODbg"      n="1"                name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="25000000"/>
      <feature type="RAM"       n="1"                name="128-Mbit SDRAM (64 Mbits accessible)"/>
      <feature type="ROM"       n="1"                name="128-Mbit Quad-SPI Flash memory"/>
      <feature type="MemCard"   n="1"                name="microSD card holder"/>
      <feature type="PWR"       n="5"                name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"         name="External Supply"/>
      <feature type="USB"       n="2"                name="USB OTG HS and FS with micro-AB Connector"/>
      <feature type="ETH"       n="1"  m="100000000" name="RJ54 Jack"/>
      <feature type="I2C"       n="1"                name="I2C extension connector"/>
      <feature type="Button"    n="2"                name="Push-buttons: User and Reset"/>
      <feature type="LineIn"    n="1"/>
      <feature type="LineOut"   n="1"/>
      <feature type="MIC"       n="2"                name="ST MEMS microphones"/>
      <feature type="ConnOther" n="1"                name="SPDIF RCA input connector"/>
      <feature type="Speaker"   n="2"/>
      <feature type="GLCD"      n="1" m="480.272"    name="Color TFT LCD with capacitive touch screen"/>
      <feature type="CustomFF"  n="80" m="130"       name="Discovery Board Formfactor"/>
      <feature type="ArduinoFF" n="1"                name="Arduino Uno 3V connectors"/>
      <feature type="Camera"    n="1"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

